[
    {
        "title": "Great Migration of Peoples",
        "description": "Mass migrations of Germanic and other tribes into the Roman Empire, leading to significant political, social, and cultural changes.",
        "year": 300
    },
    {
        "title": "Fall of the Roman Empire",
        "description": "One of the key events marking the end of Antiquity and the transition to the Middle Ages.",
        "year": 476
    },
    {
        "title": "First Crusade",
        "description": "The beginning of a series of military expeditions by Western European Christians to the Holy Land, influencing intercultural contacts and the balance of power in the Mediterranean.",
        "year": 1096
    },
    {
        "title": "Invention of the Printing Press",
        "description": "Johannes Gutenberg created the printing press, revolutionizing knowledge dissemination, increasing literacy, and forming a mass reading culture.",
        "year": 1440
    },
    {
        "title": "Discovery of America by Columbus",
        "description": "In 1492, Christopher Columbus reached the shores of the New World, initiating the Age of Great Geographical Discoveries and fundamentally changing the global economy and culture.",
        "year": 1492
    },
    {
        "title": "Industrial Revolution in England",
        "description": "From the mid-18th century, rapid mechanization of production and industrialization brought radical changes to the economy and society.",
        "year": 1760
    },
    {
        "title": "World War I",
        "description": "A global conflict (1914–1918) that drastically reshaped the world's political map, social structures, and international relations.",
        "year": 1914
    },
    {
        "title": "Moon Landing",
        "description": "In 1969, Neil Armstrong became the first person to set foot on the Moon, marking a new era in space exploration.",
        "year": 1969
    },
    {
        "title": "Creation of the World Wide Web",
        "description": "In 1991, Tim Berners-Lee introduced the concept of the WWW, ushering in the era of free information exchange and laying the foundation for the modern internet.",
        "year": 1991
    },
    {
        "title": "Foundation of SpaceX",
        "description": "In 2002, Elon Musk founded SpaceX, a private space company that revolutionized the accessibility and efficiency of space exploration.",
        "year": 2002
    }
]
